app/controllers/api/channels_controller.rb

  def create
    @channel = Channel.new(channel_params)
    # @channel.user_id = current_user.id
    if @channel.save
---
INSERT INTO "channels" ("title", "user_id", "created_at", "updated_at", "description") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "jtjtrj"], ["user_id", 1], ["created_at", "2020-12-14 23:16:32.572960"], ["updated_at", "2020-12-14 23:16:32.572960"], ["description", ""]]

  def show
    @channel = Channel.find_by(id: params[:id])
---
SELECT  "channels".* FROM "channels" WHERE "channels"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def index
    if params[:member_id]
      @channels = current_user.channels
      render :index
    else
      @channels = Channel.all
---
SELECT "channels".* FROM "channels"

  def destroy
    @channel = Channel.find_by(id: params[:id])
    if @channel
      @channel.destroy
---
SELECT  "channels".* FROM "channels" WHERE "channels"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
DELETE FROM "channels" WHERE "channels"."id" = $1  [["id", 3]]